tutorials/incompressible/wDissipationTempBlockageConcentrationResidenceSinkTauSimpleFoam/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    centralInlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1089;
        startFace       210177;
    }
    leftInlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1089;
        startFace       211266;
    }
    rightInlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1089;
        startFace       212355;
    }
    outlet
    {
        type            patch;
        nFaces          1089;
        startFace       213444;
    }
    defaultName
    {
        type            wall;
        inGroups        1(wall);
        nFaces          6534;
        startFace       214533;
    }
)

// ************************************************************************* //
